BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega329PA.PIC
        <edc:SFRDef edc:_addr="0xE6" edc:access="-nnn-nnn" edc:cname="LCDFRR" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDCD" edc:desc="LCD Clock Dividers" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="1" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="2" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="3" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="4" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="5" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="6" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="7" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="8" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDPS" edc:desc="LCD Prescaler Selects" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="ClkLCD/16" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="ClkLCD/64" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="ClkLCD/128" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="ClkLCD/256" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="ClkLCD/512" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="ClkLCD/1024" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="ClkLCD/2048" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="ClkLCD/4096" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE7" edc:access="nnnnnnnn" edc:cname="LCDCCR" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDCC" edc:desc="LCD Contrast Controls" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="2.60V" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="2.65V" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="2.70V" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="2.75V" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="2.80V" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="2.85V" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="2.90V" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="2.95V" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x08" edc:desc="3.00V" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x09" edc:desc="3.05V" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0A" edc:desc="3.10V" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0B" edc:desc="3.15V" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0C" edc:desc="3.20V" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0D" edc:desc="3.25V" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0E" edc:desc="3.30V" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0F" edc:desc="3.35V" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="LCDMDT" edc:desc="LCD Maximum Drive Time" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDDC" edc:desc="LCD Display Configuration" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="300us" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="70us" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="150us" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="450us" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="575us" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="850us" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="1150us" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="50% of LCD clock" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xE8" edc:offset="0x4"/>
        <edc:SFRDef edc:_addr="0xEC" edc:access="nnnnnnnn" edc:cname="LCDDR00" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG000" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG001" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG002" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG003" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG004" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG005" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG006" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG007" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xED" edc:access="nnnnnnnn" edc:cname="LCDDR01" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG008" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG009" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG010" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG011" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG012" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG013" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG014" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG015" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEE" edc:access="nnnnnnnn" edc:cname="LCDDR02" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG016" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG017" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG018" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG019" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG020" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG021" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG022" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG023" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEF" edc:access="nnnnnnnn" edc:cname="LCDDR03" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG024" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG025" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG026" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG027" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG028" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG029" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG030" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG031" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xF0" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xF1" edc:access="nnnnnnnn" edc:cname="LCDDR05" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG100" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG101" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG102" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG103" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG104" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG105" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG106" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG107" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF2" edc:access="nnnnnnnn" edc:cname="LCDDR06" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG108" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG109" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG110" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG111" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG112" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG113" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG114" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG115" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF3" edc:access="nnnnnnnn" edc:cname="LCDDR07" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG116" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG117" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG118" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG119" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG120" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG121" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG122" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG123" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF4" edc:access="nnnnnnnn" edc:cname="LCDDR08" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG124" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG125" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG126" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG127" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG128" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG129" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG130" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG131" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xF5" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xF6" edc:access="nnnnnnnn" edc:cname="LCDDR10" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG200" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG201" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG202" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG203" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG204" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG205" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG206" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG207" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF7" edc:access="nnnnnnnn" edc:cname="LCDDR11" edc:nzwidth="0x8" ltx:memberofperipheral="LCD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG208" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG209" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG210" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG211" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG212" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG213" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG214" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG215" edc:desc="LCD memory bit segment" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
